In [9]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "Name": ["Braud", "Allen", "Bonnell"],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"]
    }
)
df

      Name  Age     Sex
0    Braud   22    male
1    Allen   35    male
2  Bonnell   58  female

In [3]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [4]:
type(df["Age"])

pandas.core.series.Series

In [5]:
ages = pd.Series([22, 35, 58], name = "Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [6]:
df["Age"].max()

58

In [7]:
ages.max

<bound method Series.max of 0    22
1    35
2    58
Name: Age, dtype: int64>

### As methods are functions, do not forget to use parentheses ()

In [8]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

### Creating a DataFrame by passing a NumPy array with a datetime index using date_range() and labeled columns:

In [10]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df2 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df2

                   A         B         C         D
2013-01-01  0.378210  0.802136  1.196614 -0.689514
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265
2013-01-05 -0.408215  1.410055  0.742481  0.251385
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887

### Creating a DataFrame by passing a dictionary of objects where the keys are the column labels and the values are the column values

In [14]:
df3 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test","train"]),
        "F": "foo",
    }
)
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
df3.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [18]:
df3.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [19]:
df3.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df2.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df2.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df2.to_numpy()

array([[ 0.37820993,  0.8021357 ,  1.19661432, -0.68951396],
       [-1.34840911, -0.08585115, -0.82658219,  1.3321438 ],
       [ 0.57691678,  0.39247768, -1.82509792, -0.37955767],
       [-0.24587298, -0.37311723, -0.48613049, -1.92226495],
       [-0.40821521,  1.41005498,  0.74248051,  0.25138495],
       [-2.40785091, -1.02487772, -0.17562607, -0.55788668]])

In [24]:
df3.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [25]:
df2.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.575870  0.186804 -0.229057 -0.327616
std    1.125092  0.868712  1.090848  1.078855
min   -2.407851 -1.024878 -1.825098 -1.922265
25%   -1.113361 -0.301301 -0.741469 -0.656607
50%   -0.327044  0.153313 -0.330878 -0.468722
75%    0.222189  0.699721  0.512954  0.093649
max    0.576917  1.410055  1.196614  1.332144

In [26]:
df2.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.378210   -1.348409    0.576917   -0.245873   -0.408215   -2.407851
B    0.802136   -0.085851    0.392478   -0.373117    1.410055   -1.024878
C    1.196614   -0.826582   -1.825098   -0.486130    0.742481   -0.175626
D   -0.689514    1.332144   -0.379558   -1.922265    0.251385   -0.557887

In [27]:
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.689514  1.196614  0.802136  0.378210
2013-01-02  1.332144 -0.826582 -0.085851 -1.348409
2013-01-03 -0.379558 -1.825098  0.392478  0.576917
2013-01-04 -1.922265 -0.486130 -0.373117 -0.245873
2013-01-05  0.251385  0.742481  1.410055 -0.408215
2013-01-06 -0.557887 -0.175626 -1.024878 -2.407851

In [28]:
df2.sort_values(by="B")

                   A         B         C         D
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558
2013-01-01  0.378210  0.802136  1.196614 -0.689514
2013-01-05 -0.408215  1.410055  0.742481  0.251385

### Selection by label

In [29]:
df2["A"]

2013-01-01    0.378210
2013-01-02   -1.348409
2013-01-03    0.576917
2013-01-04   -0.245873
2013-01-05   -0.408215
2013-01-06   -2.407851
Freq: D, Name: A, dtype: float64

In [30]:
df2[0:3]

                   A         B         C         D
2013-01-01  0.378210  0.802136  1.196614 -0.689514
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558

In [32]:
df2["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265

In [33]:
df2.loc[dates[0]]

A    0.378210
B    0.802136
C    1.196614
D   -0.689514
Name: 2013-01-01 00:00:00, dtype: float64

In [34]:
df2.loc[:,["A","B"]]

                   A         B
2013-01-01  0.378210  0.802136
2013-01-02 -1.348409 -0.085851
2013-01-03  0.576917  0.392478
2013-01-04 -0.245873 -0.373117
2013-01-05 -0.408215  1.410055
2013-01-06 -2.407851 -1.024878

In [36]:
df2.loc["20130102":"20130104", ["B","C"]]

                   B         C
2013-01-02 -0.085851 -0.826582
2013-01-03  0.392478 -1.825098
2013-01-04 -0.373117 -0.486130

In [37]:
df2.loc[dates[0], "A"]

np.float64(0.378209926825184)

In [40]:
# A fast access to a scalar
df2.at[dates[0], "A"]

np.float64(0.378209926825184)

### Selection by position

In [41]:
df2.iloc[3]

A   -0.245873
B   -0.373117
C   -0.486130
D   -1.922265
Name: 2013-01-04 00:00:00, dtype: float64

In [42]:
df2

                   A         B         C         D
2013-01-01  0.378210  0.802136  1.196614 -0.689514
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265
2013-01-05 -0.408215  1.410055  0.742481  0.251385
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887

In [44]:
df2.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.245873 -0.373117
2013-01-05 -0.408215  1.410055

In [45]:
df2.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -1.348409 -0.826582
2013-01-03  0.576917 -1.825098
2013-01-05 -0.408215  0.742481

In [46]:
df2.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144
2013-01-03  0.576917  0.392478 -1.825098 -0.379558

In [47]:
df2.iloc[:,1:3]

                   B         C
2013-01-01  0.802136  1.196614
2013-01-02 -0.085851 -0.826582
2013-01-03  0.392478 -1.825098
2013-01-04 -0.373117 -0.486130
2013-01-05  1.410055  0.742481
2013-01-06 -1.024878 -0.175626

In [48]:
df2.iloc[1,1]

np.float64(-0.08585115088088506)

In [50]:
# A fast access to a scalar
df2.iat[1,1]

np.float64(-0.08585115088088506)

### Boolean indexing

In [51]:
df2[df2["A"]>0]

                   A         B         C         D
2013-01-01  0.378210  0.802136  1.196614 -0.689514
2013-01-03  0.576917  0.392478 -1.825098 -0.379558

In [52]:
df2[df2>0]

                   A         B         C         D
2013-01-01  0.378210  0.802136  1.196614       NaN
2013-01-02       NaN       NaN       NaN  1.332144
2013-01-03  0.576917  0.392478       NaN       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN  1.410055  0.742481  0.251385
2013-01-06       NaN       NaN       NaN       NaN

In [53]:
df4 = df2.copy()
df4["E"]=["one","one","two","three","four","three"]
df4

                   A         B         C         D      E
2013-01-01  0.378210  0.802136  1.196614 -0.689514    one
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144    one
2013-01-03  0.576917  0.392478 -1.825098 -0.379558    two
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265  three
2013-01-05 -0.408215  1.410055  0.742481  0.251385   four
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887  three

In [54]:
df4[df4["E"].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  0.576917  0.392478 -1.825098 -0.379558   two
2013-01-05 -0.408215  1.410055  0.742481  0.251385  four

### Setting by indexes

In [55]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130101", periods=6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [56]:
df2["F"]=s1
df2

                   A         B         C         D  F
2013-01-01  0.378210  0.802136  1.196614 -0.689514  1
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144  2
2013-01-03  0.576917  0.392478 -1.825098 -0.379558  3
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265  4
2013-01-05 -0.408215  1.410055  0.742481  0.251385  5
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887  6

### Setting values by labels

In [57]:
df2.at[dates[0],"A"]=0
df2

                   A         B         C         D  F
2013-01-01  0.000000  0.802136  1.196614 -0.689514  1
2013-01-02 -1.348409 -0.085851 -0.826582  1.332144  2
2013-01-03  0.576917  0.392478 -1.825098 -0.379558  3
2013-01-04 -0.245873 -0.373117 -0.486130 -1.922265  4
2013-01-05 -0.408215  1.410055  0.742481  0.251385  5
2013-01-06 -2.407851 -1.024878 -0.175626 -0.557887  6

In [58]:
df2.at[dates[0], "A"]=0

### Setting values by position

In [59]:
df2.iat[0,1]=0

### Setting by assigning with a NumPy array

In [60]:
df2.loc[:, "D"]= np.array([5]*len(df2))
df2

                   A         B         C    D  F
2013-01-01  0.000000  0.000000  1.196614  5.0  1
2013-01-02 -1.348409 -0.085851 -0.826582  5.0  2
2013-01-03  0.576917  0.392478 -1.825098  5.0  3
2013-01-04 -0.245873 -0.373117 -0.486130  5.0  4
2013-01-05 -0.408215  1.410055  0.742481  5.0  5
2013-01-06 -2.407851 -1.024878 -0.175626  5.0  6

Setting with a where operation

In [61]:
df4 = df2.copy()
df4[df4>0] = -df4
df4

                   A         B         C    D  F
2013-01-01  0.000000  0.000000 -1.196614 -5.0 -1
2013-01-02 -1.348409 -0.085851 -0.826582 -5.0 -2
2013-01-03 -0.576917 -0.392478 -1.825098 -5.0 -3
2013-01-04 -0.245873 -0.373117 -0.486130 -5.0 -4
2013-01-05 -0.408215 -1.410055 -0.742481 -5.0 -5
2013-01-06 -2.407851 -1.024878 -0.175626 -5.0 -6

### Missing data

In [62]:
df5 = df2.reindex(index=dates[0:4], columns=list(df2.columns) + ["E"])
df5.loc[dates[0]:dates[1], "E"]=1
df5

                   A         B         C    D  F    E
2013-01-01  0.000000  0.000000  1.196614  5.0  1  1.0
2013-01-02 -1.348409 -0.085851 -0.826582  5.0  2  1.0
2013-01-03  0.576917  0.392478 -1.825098  5.0  3  NaN
2013-01-04 -0.245873 -0.373117 -0.486130  5.0  4  NaN

In [63]:
df5.dropna(how="any")

                   A         B         C    D  F    E
2013-01-01  0.000000  0.000000  1.196614  5.0  1  1.0
2013-01-02 -1.348409 -0.085851 -0.826582  5.0  2  1.0

In [64]:
df5.fillna(value=5)

                   A         B         C    D  F    E
2013-01-01  0.000000  0.000000  1.196614  5.0  1  1.0
2013-01-02 -1.348409 -0.085851 -0.826582  5.0  2  1.0
2013-01-03  0.576917  0.392478 -1.825098  5.0  3  5.0
2013-01-04 -0.245873 -0.373117 -0.486130  5.0  4  5.0

In [65]:
pd.isna(df5)

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Stats

In [66]:
df2.mean()

A   -0.638905
B    0.053114
C   -0.229057
D    5.000000
F    3.500000
dtype: float64

In [67]:
df2.mean(axis=1)

2013-01-01    1.439323
2013-01-02    0.947832
2013-01-03    1.428859
2013-01-04    1.578976
2013-01-05    2.348864
2013-01-06    1.478329
Freq: D, dtype: float64

In [68]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [69]:
df2.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.423083 -0.607522 -2.825098  4.0  2.0
2013-01-04 -3.245873 -3.373117 -3.486130  2.0  1.0
2013-01-05 -5.408215 -3.589945 -4.257519  0.0  0.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### User defined functions

In [71]:
df2.agg(lambda x: np.mean(x)*5.6)

A    -3.577869
B     0.297441
C    -1.282719
D    28.000000
F    19.600000
dtype: float64

In [76]:
df2.transform(lambda x: x*100)

                     A           B           C      D    F
2013-01-01    0.000000    0.000000  119.661432  500.0  100
2013-01-02 -134.840911   -8.585115  -82.658219  500.0  200
2013-01-03   57.691678   39.247768 -182.509792  500.0  300
2013-01-04  -24.587298  -37.311723  -48.613049  500.0  400
2013-01-05  -40.821521  141.005498   74.248051  500.0  500
2013-01-06 -240.785091 -102.487772  -17.562607  500.0  600

### Values counts

In [78]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    4
2    4
3    0
4    4
5    3
6    5
7    4
8    0
9    0
dtype: int64

In [79]:
s.value_counts()

4    4
0    3
2    1
3    1
5    1
Name: count, dtype: int64

### String methods

In [80]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

In [81]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.572713  0.805534 -1.131302  0.376127
1 -0.118556 -0.976280 -0.006290  0.309262
2 -1.095186  1.118164  1.522529  0.024808
3  0.212105 -0.612123  0.512756  1.470999
4 -0.371887 -0.051687 -1.784540 -0.956776
5 -1.634331 -0.890175 -0.633507 -0.407010
6  0.630776 -0.628706  0.377451  0.924495
7  0.115668 -0.434492 -0.704088  0.460795
8  0.331151  0.141634  0.554524  0.954898
9 -0.932350 -0.268466  1.869447  2.359345

In [82]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.572713  0.805534 -1.131302  0.376127
 1 -0.118556 -0.976280 -0.006290  0.309262
 2 -1.095186  1.118164  1.522529  0.024808,
           0         1         2         3
 3  0.212105 -0.612123  0.512756  1.470999
 4 -0.371887 -0.051687 -1.784540 -0.956776
 5 -1.634331 -0.890175 -0.633507 -0.407010
 6  0.630776 -0.628706  0.377451  0.924495,
           0         1         2         3
 7  0.115668 -0.434492 -0.704088  0.460795
 8  0.331151  0.141634  0.554524  0.954898
 9 -0.932350 -0.268466  1.869447  2.359345]

In [84]:
pd.concat(pieces)

          0         1         2         3
0 -0.572713  0.805534 -1.131302  0.376127
1 -0.118556 -0.976280 -0.006290  0.309262
2 -1.095186  1.118164  1.522529  0.024808
3  0.212105 -0.612123  0.512756  1.470999
4 -0.371887 -0.051687 -1.784540 -0.956776
5 -1.634331 -0.890175 -0.633507 -0.407010
6  0.630776 -0.628706  0.377451  0.924495
7  0.115668 -0.434492 -0.704088  0.460795
8  0.331151  0.141634  0.554524  0.954898
9 -0.932350 -0.268466  1.869447  2.359345

In [85]:
left = pd.DataFrame({"key":["foo","foo"],"lval":[1, 2]})
right = pd.DataFrame({"key":["foo","foo"],"rval":[4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [86]:
left = pd.DataFrame({"key":["foo","bar"],"lval":[1, 2]})
right = pd.DataFrame({"key":["foo","bar"],"rval":[4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5